leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc563Xm_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5634MPORTS_H
#define _MPC5634MPORTS_H

#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER1 PORT_FUNC2
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER2 PORT_FUNC4
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER1 PORT_FUNC2
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER2 PORT_FUNC4
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_340_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_340_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_340_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_340_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_345_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_344_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_344_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_336_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_338_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_338_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_339_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_339_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_342_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_342_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_342_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER1 PORT_FUNC5
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC5
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER0 PORT_FUNC1
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER PORT_FUNC4
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0

#endif  /* _MPC5634MPORTS_H */
